# Математические функции
# В таблице перечислены наиболее распространенные математические функции вместе с
# короткими примерами.


# Функция             |Описание
#---------------------------------------------------------------------------------------
# abs(x)              |Модуль. abs(-4) равно 4
#---------------------- 
# sqrt(x)             |Квадратный корень. sqrt(25) равно 5. Это то же самое, что и 25^(0.5)
#----------------------
# ceiling(x)          |Наименьшее целочисленное значение, не меньшее, чем x.
#                     |ceiling(3.457) равно 4
#----------------------
# floor(x)            |Наибольшее целочисленное значение, не большее, чем x.
#                     |floor(3.457) равно 3
#----------------------
# trunk(x)            |Целое число, полученное при округлении x в сторону нуля.
#                     |trunk(5.99) равно 5
#----------------------
# round(x, digits=n)  |Округляет x до заданного числа знаков после запятой
#                     |round(3.475, digits=2) равно 3.48
#----------------------
# signif(x, digits=n) |Округляет x до заданного числа значащих цифр
#                     |signif(3.475, digits=2) равно 3.5
#----------------------
# cos(x)              | Косинус, синус и тангенс. 
# sin(x)              | cos(2) равно -0.416
# tan(x)              |
#----------------------
# acos(x)             | Арккосинус, арксинус и арктангенс. 
# asin(x)             | acos(-0.416) равно 2
# atan(x)             |
#----------------------
# cosh(x)             | Гиперболические косинус, синус и тангенс.
# sinh(x)             | sinh(2) равно 3.627
# tanh(x)             |
#----------------------
# acosh(x)            | Гиперболические арккосинус, арксинус и арктангенс.
# asinh(x)            | asinh(3.627) равно 2
# atanh(x)            |
#----------------------
# log(x, base=n)      | Логарифм x по основанию n
# log(x)              | Для удобства: log(x) – натуральный логарифм, 
# log10(x)            |               log10(x) – десятичный логарифм
#                     | log(10) равно 2.3026
#                     | log10(10) равно 1
#----------------------
# exp(x)              | Экспоненциальная функция. exp(2.3026) равно 10
#-------------------------------------------------------------------------------------

# Функция t() служит для транспонирования матрицы