# В приведенных ниже примерах мы будем демонстрировать результаты исследования нового
# метода лечения ревматоидного артрита. Соответствующие данные содержатся в таблице данных
# Arthritis, распространяемой с пакетом vcd. Поскольку этот пакет не входит в базовую версию R,
# убедитесь, что вы скачали и установили его перед тем, как использовать его в первый раз.
# Учтите, что пакет vcd не нужен для построения столбчатых диаграмм. Мы загружаем его для
# того, чтобы получить доступ к таблице данных Arthritis. Зато этот пакет понадобится нам для
# создания спинограмм

library(vcd)
View(Arthritis)